console.log('number' + 3 + 3); //Результат: number33;
// В даному випадку відбувається конкатенація i тип даних number перетворюється в string. В результаті отримуємо рядок.
console.log(null + 3); //Результат: 3;
//В даному випадку, null прирівнюється до нуля для виконання простої дії додавання і в результаті отримуємо 0+3=3;
console.log(+'40' + +'2' + "hillel"); //Результат: 42hillel;
/*Плюс перед рядком '40' та додатковий плюс перед рядком '2' перетворює string в number, виконується математичне додавання 
та далі відбувається перетворення в зворотньому напрямку, в результаті отримуємо рядок;*/
console.log('10' - 5 === 6); //Результат: false
//Спочатку проводиться математичне віднімання, string конвертується в number і отримуємо 5, після проводимо порівняння, 5=6 - false;
console.log(true + false); //Результат: 1
//true = 1, false = 0 - загальноприйняте правило, в результаті додавання 1+0, отримаємо 1;
console.log('4px' - 3); //Результат: NaN
//Віднімання від рядка (string даних), якщо це не число неможливо, рядок не буде конвертовано в число, тому результат Not_a_Number;
console.log('4' - 3); //Результат: 1
//В цьому ж випадку, рядок перетворюється в число і проведення віднімання за загальними математичними правиламо здійснюється;
console.log('6' + 3 ** 0); //Результат: 61
//Оператор ** - піднесення до степеня, тобто 3 в нульовій степені (як і будь-яке число) = 1, a далі запис в рядок - 61.
console.log(12 / '6'); //Результат: 2
//При діленні рядок також конвертується в число, якщо це можливо, як в даному випадку, і отримуємо результат математичної дії
console.log(null == ''); //Результат: false
//null це відсутність даних, які порівнюються з пустим рядком, що не є одним і тим же, результат порівняння false
console.log(3 ** (9 / 3)); //Результат: 27
//Спочатку дія в дужках - ділення, а потім рахуємо три в третій степені;
console.log(!!'false' == !!'true'); //Результат: true
//!! - конвертує не пусте рядкове значення в boolean як true, з обох боків порівняння.
console.log((+null == false) < 1); //Результат: false
/*Оператор + перед null конвертує в число -0, false = 0 (правило), 0=0 - це true, при порівнянні true конвертується в число, тобто 1
а так як 1 не менше 1, то це false*/
console.log(false && true || true); //Результат: true
//спочатку визначаємо за оператором і, отримуємо false, при подальшому виконанні оператора або отримуємо true;
console.log(false && (false || true)); //Результат: false
//Виконуємо дію в дужках з оператором або - true, а потім з оператором і та отримуємо false
console.log((+null == false) < 1 ** 5); //Результат: false
/*Оператор + перед null конвертує в число -0, false = 0 (правило), 0=0 - це true, при порівнянні true конвертується в число, тобто 1
також 1 в пятій ступені дорівнює 1, а отже маємо нерівність 1 менше одного, тобто результат false.*/